define(function(require, exports, module) {
  var a = {
    VEHICLE_LENGTHS: ["不限", "4.2米", "4.5米", "6.2米", "6.8米", "7.2米", "8.2米", "8.6米", "9.6米", "11.7米", "12.5米", "13米", "13.5米", "14米", "17米", "17.5米", "18米"],
    VEHICLE_TYPES: ["不限", "平板", "高栏", "厢式", "高低板", "保温", "冷藏", "危险品"],
    CARGO_TYPES: ["普货", "重货", "泡货", "设备", "配件", "百货", "建材", "食品", "饮料", "化工", "农药", "水果", "蔬菜", "木材", "煤炭", "石材", "瓷砖", "其他"],
    USEFUL_EXPRESSION: ["急装", "随装", "包来回", "高价急走", "装车付款", "门面装货", "本地装货", "求本地装货", "车型不限", "运价好商量", "马上可以装货", "今天订明天装", "不装水果"],
    UNIT: ["吨", "方", "件", "车", "个", "台", "箱"],
    RE_COUNT: ["不重发", "5次", "10次", "20次", "30次", "60次"],
    RE_INTERVAL: ["5分钟", "10分钟", "20分钟", "30分钟", "60分钟"],
    VEHICLE_ZERO: ["是", "不是"],
    carNumber : {
      name : 'carNumber',
      sub : [
        {
          name: 'site',
          sub : ["京", "津", "沪", "渝", "冀", "豫","鲁", "晋", "陕", "皖", "苏", "浙","鄂", "湘", "赣", "闽", "粤", "桂","琼", "川", "贵", "云", "辽", "吉","黑", "蒙", "甘", "宁", "青", "新","藏", "港", "澳", "台",''],
          length : 1
        },
        {
          name: 'num',
          sub : ["A", "B", "C", "D", "E", "F","G", "H", "J", "K", "L", "M","N", "P", "Q", "R", "S", "T","U", "V", "W", "X", "Y", "Z","0", "1", "2", "3", "4", "5","6", "7", "8", "9",''],
          length : 6
        }
      ],
      maxLength: 7,
      minLength: 1
    }
  };
  return a
})
